#+startup: beamer
#+title: Advanced mixed-models workshop: Session 5
#+author: Dale Barr
#+email: dale.barr@glasgow.ac.uk
#+date: Bremen March 2015
#+OPTIONS: toc:nil H:2 ^:nil
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: []
#+BEAMER_THEME: Boadilla
#+LATEX_HEADER: \makeatletter \def\verbatim{\scriptsize\@verbatim \frenchspacing\@vobeyspaces \@xverbatim} \makeatother

#+BEAMER_COLOR_THEME: seahorse
#+LATEX_HEADER: \definecolor{lgray}{rgb}{0.90,0.90,0.90}
#+LATEX_HEADER: \beamertemplatenavigationsymbolsempty
#+LATEX_HEADER: \usemintedstyle{tango}
#+LATEX_HEADER: \institute{University of Glasgow}

#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)

#+PROPERTY: header-args:R :session *R* :exports both :results output :tangle session_05.R

** View results

#+BEGIN_SRC R :exports results
  summary(mod)
#+END_SRC

#+RESULTS:
#+begin_example
Generalized linear mixed model fit by maximum likelihood (Laplace
  Approximation) [glmerMod]
 Family: binomial  ( logit )
Formula: Accuracy ~ V1 + V2 + (V1 + V2 | SessionID) + (V1 + V2 | ItemID)
   Data: dat1
Control: glmerControl(optimizer = "bobyqa")

     AIC      BIC   logLik deviance df.resid 
  4149.4   4249.3  -2059.7   4119.4     5745 

Scaled residuals: 
     Min       1Q   Median       3Q      Max 
-12.1153   0.1436   0.2594   0.4351   1.3263 

Random effects:
 Groups    Name        Variance  Std.Dev. Corr       
 ItemID    (Intercept) 0.4185370 0.64694             
           V1          0.0202878 0.14244   0.14      
           V2          0.0118758 0.10898  -1.00 -0.17
 SessionID (Intercept) 1.3562216 1.16457             
           V1          0.0004334 0.02082   1.00      
           V2          0.0008073 0.02841  -1.00 -1.00
Number of obs: 5760, groups:  ItemID, 96; SessionID, 20

Fixed effects:
            Estimate Std. Error z value Pr(>|z|)    
(Intercept)  2.30963    0.27516   8.394   <2e-16 ***
V1           0.03101    0.13817   0.224    0.822    
V2           0.09727    0.13859   0.702    0.483    
---
Signif. codes:  0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1

Correlation of Fixed Effects:
   (Intr) V1    
V1  0.042       
V2 -0.059  0.483
#+end_example

** Multiparameter test

#+BEGIN_SRC R :cache yes
  mod2 <- update(mod, . ~ . - V1 - V2)

  anova(mod, mod2)
#+END_SRC

#+RESULTS[4c68ebce9d6f2bccff7dbb0e31316bcadb39a9ad]:
: Data: dat1
: Models:
: mod2: Accuracy ~ (V1 + V2 | SessionID) + (V1 + V2 | ItemID)
: mod: Accuracy ~ V1 + V2 + (V1 + V2 | SessionID) + (V1 + V2 | ItemID)
:      Df    AIC    BIC  logLik deviance  Chisq Chi Df Pr(>Chisq)
: mod2 13 4145.9 4232.4 -2059.9   4119.9                         
: mod  15 4149.4 4249.3 -2059.7   4119.4 0.4632      2     0.7933

** Interpreting results: Odds ratios

- use the =exp()= function to get odds ratios

The \(\beta\) associated with =V1= is the change (in logit space)
associated with hearing the name in the same voice as in training
vs. a different voice

How does that "change the odds" of clicking the right person?

#+BEGIN_SRC R
  c(params["V1"], OR = exp(params["V1"]))
#+END_SRC

#+RESULTS:
:         V1      OR.V1 
: 0.03101181 1.03149769

